text_numb_date_1 = """Ф 1-28/09-2024-Д

Общество с ограниченной ответственностью «ЛИГА-СЕРТ»

ЛИГА-СЕРТ

Испытательная лаборатория

(ООО «ЛИГА-СЕРТ»)

109383, г. Москва, вн.тер.г.муниципальный округ Печатники, ул. Песчаный карьер, д.З, стр.1

ИСПЫТАТЕЛЬНАЯ ЛАБОРАТОРИЯ

Фактический адрес места осуществления деятельности:

109383, РОССИЯ, Москва г, улица Песчаный Карьер, дом 3 строение 1, ком. 25,28, 29,30,31,33,33а, 
336,34, 35, 36, 37,37а, 38,38а, 39,40,41, 42,43,44,45, 46, 47, 48,49, 50,51,52, 
53, 54, 55,56, 57, 58, 60,61, 62, 63,64,65, 66, 67,68,69 тел.: 8 (495)379-51-11. e-mail: labia'labsert.ru

Аттестат аккредитации: РОСС RU.31112.21ПР71

Лицензия: 77.01.13.001 .Л.000039.09.19



УТВЕРЖДАЮ

Заместитель руководителя ИЛ ООО «ЛИГА-СЕРТ»



Протокол испытаний № 8281 /24-Д от «29» августа 20 24 г.

Заявитель, ИНН

АО «ДИКСИ ЮГ», ИНН: 5036045205

Юридический адрес

МО, г. Подольск, ул. Юбилейная, д. 32 А

Фактический адрес места осуществления деятельности

г. Калуга, ул. Ленина, д.58 (№40515)

Номер заявки и дата

№8/24 от 10.01.2024 г.

Место отбора проб

г. Калуга, ул. Ленина, д.58 (№40515)

Дата и время отбора проб

13.08.2024 г.. 09 ч. 15 мин.

Ф.И.О., должность сотрудника, производившего отбор проб

Руденко Н.А., помощник сан/врача

Дата и время доставки проб в лабораторию

13.08.2024 г., 17 ч. 00 мин.

Сопроводительные документы

Акт отбора проб № 8281 от 13.08.2024 г.

Количество зашифрованных проб

3

Протокол составлен в 2-х экземплярах





Данные о пробе

Шифр пробы

8281-1

Г руппа продукции

Производство магазина

Наименование продукции

Лепешка томаты с базиликом

НД на продукцию

СТО 56811319-002-2017

Дата производства продукции

13.08.2024 г. Срок годности 12 часов

Производитель (фирма, предприятие, организация)

АО «ДИКСИ ЮГ»"""

text_numb_date_2 = """ ИГА-СЕРТ

Испытательная лаборатория

ЛИГА-СЕРТ

Испытательная лаборатория

УТВЕРЖДАЮ

УТВЕРЖДАЮ

		«	 СГ&иЛ	г.

		«	 СГ&иЛ	г.

ИСПЫТАТЕЛЬНАЯ ЛАБОРАТОРИЯ

Фактический адрес места осуществления деятельности:

109383, РОССИЯ, Москва г, улица Песчаный Карьер, дом 3 строение I, ком. 25.28.
29.30.31. 33.33а. 336, 34.35,36.37. 37а, 38, 38а, 39.40, 41. 42.43.44. 45, 46.47.

48,49, 50. 51, 52, 53. 54, 55. 56. 57. 58, 60. 61.62,63, 64, 65, 66.67. 68,69 тел.: 8 (495)379-51-11, e-mail: labfi'labsert.ru Аттестат аккредитации: РОСС RU.31112.21 ПР71 Лицензия: 77.01.13.001.Л.000039.09.19

Заместитель руководителя ИЛ ООО «ЛИГА-СЕРТ»

				Т.Н. Стальная

Заявитель. ИНН

АО «ДИКСИ ЮГ», ИНН: 5036045205

Юридический адрес

МО, г. Подольск, ул. Юбилейная, д. 32 А

Фактический адрес места осуществления деятельности

г. Москва, д. Яковлевское, д.21 (№50686)

Номер заявки и дата

№8/24 от 10.01.2024 г.

Место отбора проб

г. Москва, д. Яковлевское, д.21 (№50686)

Дата и время отбора проб

12.07.2024 г., 10 ч. 34 мин.

Ф.И.О., должность сотрудника, производившего отбор проб

Руденко Н.А., помощник сан/врача

Дата и время доставки проб в лабораторию

12.07.2024 г., 16 ч. 25 мин.

Сопроводительные документы

Акт отбора проб № 7241 от 12.07.2024 г.

Количество зашифрованных проб

3

Протокол составлен в 2-х экземплярах

	Протокол испытаний №	7241/24-Д от «25»

июля 2024 г.



Данные о пробе

Шифр пробы

7241-1
"""

text_numb_date_3 = """ ИГА-CEPT

Испытательная лаборатория

ЛИГА-CEPT

Испытательная лаборатория

ИСПЫТАТЕЛЬНАЯ ЛАБОРАТОРИЯ

Фактический адрес места осуществления деятельности:

109383, РОССИЯ, Москва г, улица Песчаный Карьер, дом 3 строение 1, ком. 25,28,
29,30.31.33,33а, 336,34,35,36,37,37а, 38,38а, 39,40,41,42,43,44, 45,46,47,

	50, 51,52, 53, 54, 55, 56, 57, 58. 60, 61,62,63,64,65,66,67,68.69 тел.: 8 (495)379-51-11, e-mail: lab@labsert.ru

Аттестат аккредитации: РОСС RU.31112.2ШР71

Лицензия; 77.01.13.001 Л.000039.09.19

УТВЕРЖДАЮ

Заместитель руководителя ИЛ ООО «ЛИГА-СЕРТ»

						Т.Н. Стальная « с№у>	 (//Сил	20 г.

		Протокол испытаний №	6789 /24-Д от «22»	июля 2024 г.

Заявитель. ИНН

АО «ДИКСИ ЮГ», ИНН: 5036045205

Юридический адрес

МО, г. Подольск, ул. Юбилейная, д. 32 А

Фактический адрес места осуществления деятельности

г. Москва, ул. Юных Ленинцев, д.43/33 (№77189)

Номер заявки и дата

№ 8/24 от 10.01.2024 г.

Место отбора проб

г. Москва, ул. Юных Ленинцев, д.43/33 (№77189)

Дата и время отбора проб

05,07.2024 г., 11 ч. 33 мин.

Ф.И.О., должность сотрудника, производившего о тбор проб

Руденко Н.А., помощник сан/врача

Дата и время доставки проб в лабораторию

05.07.2024 г., 17 ч. 30 мин.

Сопроводительные документы

Акт отбора проб № 6789 от 05.07.2024 г.

Количество зашифрованных проб

5

Протокол составлен в 2-х экземплярах


Данные о пробе

Шифр пробы

6789-1

Группа продукции

Продукция производителя """

DATA_NUMB_DATE = [text_numb_date_1, text_numb_date_2, text_numb_date_3]

PROD_CONTROL_STR = (
    '\nАттестат аккредитации: РОСС RU.31112.21ПР52\nЛицензия: 77.01.13.001 .Л.000039.09.19'
    '\n\n\n\nПРОТОКОЛ № 4218/24-Д\nизмерений по производственному контролю\nот «07» мая 2024 '
    'г.\n\n\tНомер и дата заявки: 8/24 от 10.01.2024 г.\n\n\tЗаявитель и его адрес '
    '(юридический и фактический): АО «ДИКСИ-Юг», Московская обл., г. Подольск, ул. Юбилейная, '
    'д. 32А\n\n\t№ Акта и дата проведения измерений: 4218 ОТ 02.05.2024 г.\n\n\t'
    'Адрес проведения измерений: Ленинградская обл., г. Гатчина, ул. Куприна, д.48А, лит. А, '
    'магазин № 47109\n\n\tСведения о средствах измерения:\n\n\nК протоколу № 4218/24-Д'
    ' от 07.05.2024 г.\n\nЗАКЛЮЧЕНИЕ\n\nРезультаты проведенных измерений показали, '
    'что на объекте заказчика АО «ДИКСИ-ЮГ», расположенном по адресу: '
    'Ленинградская обл., г. Гатчина, ул. Куприна, Д.48А, лит. А, магазин № 47109\n\n- '
    'на момент проведения измерений параметры микроклимата, уровни шума и общей вибрации '
    'соответствуют требованиям\n\nСанПиН 1.2.3685-21 «Гигиенические нормативы и требования'
    ' к обеспечению безопасности и (или) безвредности для человека факторов среды обитания».'
    '\n\n\n\nСанитарный врач\n\nСанитарный врач\n\n(подпись)\n')
