import re


def fix_spelling_errors(value):
    """ Исправить неточности, допущенные при конвертировании файла. """
    # Убрать табуляцию.
    value = value.strip('\t')
    # Паттерны для замены орфографических ошибок и неточностей в показателях и нормах.
    replacements = [

        (r'l', '1'),

        # 'Ю' вместо 10 и другие варианты ошибок в 10
        (r'[хx]Ю', 'х10'),
        (r'lO|1O', '10'),
        (r'1\s*.\s*[OО]', '1.0'),
        (r'Ю([,\.]\d)', r'10\1'),

        # Замена букв на '11'.
        (r'[ПHН]([,\.]\d)', r'11\1'),

        # Запятых на точки.
        (r'([\dOО]),([\dOО])', r'\1.\2'),

        # Замена буквы 'O' на ноль 0.
        (r'[ОO](\.[\dIlOО])', r'0\g<1>'),
        (r'([\dIlOО]\.)[ОO]', r'\g<1>0'),

        # Замена буквы 'I' на 1.
        (r'I([,\.][\dOО])', r'1\1'),
        (r'I([,\.][\dOО])', r'1\1'),

        # Замена буквы 'б' вместо цифры '6'.
        (r'(\d)б', r'\g<1>6'),
        (r'б(\.\d)', r'6\g<1>'),
        (r'б(\d)', r'6\g<1>'),
        (r'(\d\.)б', r'\g<1>6'),

        # Исправление орфографических ошибок в словах.
        (r'\bн[сc]\b', 'не '),
        (r'\b[нпли][ес] более', 'не более'),
        (r'\b[нпли][ес] допускаю\s*[тг]\s*[се]я', 'не допускаются'),
        (r'([нлпияВt][есоi]|tiec)\s*обнару\s*(ж|ок)[ес]н[оы]', 'не обнаружено'),
        (r'^о\s*[тг]\s*сутствие$', 'отсутствие'),
        (r'з\s*а\s*п\s*а\s*х\s*', 'запах '),
        (r'в\s*к\s*у\s*с', 'вкус'),
        (r'не более 0.0\$', 'не более 0.03'),
        (r'не менее 0.0\$', 'не менее 0.03'),

        # Замена символом на ±.
        (r'([\d\.]+)([xх*])\s*([234567890]+\.\d*)', r'\1±\3'),

        # Лишние пробелы.
        (r'\s{2,}', ' '),

        # Замены символов на знак умножения.
        (r'(\d\s*)[•■xх]\s*(\d*)', r'\1x\2'),
        ('x10s', 'x10⁵'),
    ]

    # Если значение предполагает '-', но в документе записан как какой-либо символ.
    patt_none = r'^[“\s]*[-—*]\s*$|^[•\*]\s*$|^$'
    if re.search(patt_none, value, flags=re.IGNORECASE):
        return '-'

    # Перебираем паттерны и устраняем недостатки.
    for pattern, replacement in replacements:
        value = re.sub(pattern, replacement,  value, flags=re.IGNORECASE)

    return value
